const age = 19;

// if (age < 18) {
//   console.log("Ви не повнолітній");
// }

// if (age >= 18) {
//   console.log("Ви можете подорожувати за кордон самостійно");
// } else {
//   console.log("Ви не повнолітній");
// }

// if (age > 18) {
//   console.log("Ви можете подорожувати за кордон самостійно");
// } else if (age === 18) {
//   console.log("Ви можете подорожувати за кордон самостійно");
// } else {
//   console.log("Ви не повнолітній");
// }

// switch (true) {
//   case age >= 18:
//     console.log("Ви можете подорожувати за кордон самостійно");

//     break;
  
//   default:
//     console.log("Ви не повнолітній");

//     break;
// }

// console.log(1 >= true);

// const testAge =
//   age >= 18
//     ? "Ви можете подорожувати за кордон самостійно"
//     : "Ви не повнолітній";

// console.log(testAge);

// let number = prompt("Введіть число");
// // const message = number < 0 ? -1 : 0;
// // alert(message);

// number < 0 ? alert(-1) : alert(0);

// let userAnswer = prompt("Яка офіційна назва JavaScript?");
// userAnswer = userAnswer.toLowerCase();
// const userAnswerCheck =
//   userAnswer === "ecmascript" ? "Правильно!" : "Не правильно!";

// alert(userAnswerCheck);

// Напиши скрипт обробки покупки в магазині.
// - Баланс користувача зберігається в змінній balance - отримати з інпуту
// - Сумма покупки зберігається в змінній payment - отримати з інпуту
// - Перед перевіркою вивести повідомлення на екран:
// «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість
// доступних коштів на рахунку»
// - Якщо сума покупки не перевищує баланс:
// - Відняти з балансу суму покупки
// - Вивести повідомлення «На рахунку залишилося [число] кредитів»
// - Якщо сума покупки перевищує баланс:
// - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
// - В кінці вивести повідомлення «Операція завершена»

// let balance = Number(prompt("Введіть калькість грошей на рахунку"));
// const payment = Number(prompt("Введіть суму покупки"));

// if (balance >= payment) {
//   balance -= payment;

//   alert(`На рахунку залишилося ${balance} кредитів`);
// } else {
//   alert("На рахунку недостатньо коштів для проведення операції!");
// }

// alert("Операція завершена");

// const balance = Number(prompt("Введіть калькість грошей на рахунку"));
// const payment = Number(prompt("Введіть суму покупки"));
// const lastBalance = balance - payment;

// const newBalance =
//   balance >= payment
//     ? `На рахунку залишилося ${lastBalance} кредитів`
//     : "На рахунку недостатньо коштів для проведення операції!";

// alert(newBalance);

// Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої суми за весь час (партнерська програма).
// Користувач вводить в інпут сумму витрачену в даному магазині і отримує розмір знижки як результат.
// - Загальна сума витрачених коштів зберігається в змінній totalSpent
// - Сума поточного платежа зберігається в змінній payment
// - Знижка зберігається в змінній discount

// - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
// - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
// - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
// - Якщо витрачено менше 100) - не партнер, знижка 0%

// - В результаті вивести повідомлення
// «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»

// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'

// const totalSpent = Number(prompt("Введіть суму витрачених коштів"));
// let discount;
// let payment;

// if (totalSpent >= 100 && totalSpent <= 1000) {
//   discount = 0.02;
//   payment = totalSpent - totalSpent * discount;

//   alert(
//     `Оформляемо замовлення на суму ${payment} зі знижкою ${discount * 100}%`
//   );
// } else if (totalSpent > 1000 && totalSpent <= 5000) {
//   discount = 0.05;
//   payment = totalSpent - totalSpent * discount;

//   alert(
//     `Оформляемо замовлення на суму ${payment} зі знижкою ${discount * 100}%`
//   );
// } else if (totalSpent > 5000) {
//   discount = 0.1;
//   payment = totalSpent - totalSpent * discount;

//   alert(
//     `Оформляемо замовлення на суму ${payment} зі знижкою ${discount * 100}%`
//   );
// } else {
//   payment = totalSpent;

//   alert(`Оформляемо замовлення на суму ${payment}`);
// }
